In [6]:
import pandas as pd
titanic_df = pd.read_csv("C:\\Users\\adity\\Desktop\\titanic3.csv")

In [7]:
print (titanic_df.head()) #first 5 rows using head() method

   pclass  survived                                             name     sex  \
0     1.0       1.0                    Allen, Miss. Elisabeth Walton  female
1     1.0       1.0                   Allison, Master. Hudson Trevor    male
2     1.0       0.0                     Allison, Miss. Helen Loraine  female
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton    male
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female

       age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0  29.0000    0.0    0.0   24160  211.3375       B5        S    2    NaN
1   0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11    NaN
2   2.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN    NaN
3  30.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN  135.0
4  25.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN    NaN

                         home.dest
0                     St Louis, MO
1  Montreal, PQ / Chesterville, ON
2  Montreal, PQ / Chesterville, ON
3  Montreal, PQ / Chesterville, ON
4  Montreal, PQ / Chesterville, ON

In [19]:
ages = titanic_df["age"]
print(ages)
print(type(ages))

0       29.0000
1        0.9167
2        2.0000
3       30.0000
4       25.0000
         ...
1305        NaN
1306    26.5000
1307    27.0000
1308    29.0000
1309        NaN
Name: age, Length: 1310, dtype: float64
<class 'pandas.core.series.Series'>

In [17]:
age_sex =titanic_df[["age","sex"]]
print(age_sex.head())

print(type(age_sex))

print(age_sex.shape)

       age     sex
0  29.0000  female
1   0.9167    male
2   2.0000  female
3  30.0000    male
4  25.0000  female
<class 'pandas.core.frame.DataFrame'>
(1310, 2)

In [22]:
age_less_35=titanic_df[titanic_df["age"]<35] #the names of passengers younger than 35 years (2. Ans)
print(age_less_35)

      pclass  survived                                             name  \
0        1.0       1.0                    Allen, Miss. Elisabeth Walton
1        1.0       1.0                   Allison, Master. Hudson Trevor
2        1.0       0.0                     Allison, Miss. Helen Loraine
3        1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1300     3.0       1.0          Yasbeck, Mrs. Antoni (Selini Alexander)
1304     3.0       0.0                             Zabour, Miss. Hileni
1306     3.0       0.0                        Zakarian, Mr. Mapriededer
1307     3.0       0.0                              Zakarian, Mr. Ortin
1308     3.0       0.0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000    0.0    0.0   24160  211.3375       B5        S    2
1       male   0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11
2     female   2.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
3       male  30.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
4     female  25.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1300  female  15.0000    1.0    0.0    2659   14.4542      NaN        C  NaN
1304  female  14.5000    1.0    0.0    2665   14.4542      NaN        C  NaN
1306    male  26.5000    0.0    0.0    2656    7.2250      NaN        C  NaN
1307    male  27.0000    0.0    0.0    2670    7.2250      NaN        C  NaN
1308    male  29.0000    0.0    0.0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1300    NaN                              NaN
1304  328.0                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[701 rows x 14 columns]

In [25]:
class_2_3=titanic_df[titanic_df["pclass"].isin([2,3])] #isin() to filter the 2nd and 3rd class passengers
print(class_2_3)

      pclass  survived                                   name     sex   age  \
323      2.0       0.0                    Abelson, Mr. Samuel    male  30.0
324      2.0       1.0  Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0
325      2.0       0.0         Aldworth, Mr. Charles Augustus    male  30.0
326      2.0       0.0             Andrew, Mr. Edgardo Samuel    male  18.0
327      2.0       0.0               Andrew, Mr. Frank Thomas    male  25.0
...      ...       ...                                    ...     ...   ...
1304     3.0       0.0                   Zabour, Miss. Hileni  female  14.5
1305     3.0       0.0                  Zabour, Miss. Thamine  female   NaN
1306     3.0       0.0              Zakarian, Mr. Mapriededer    male  26.5
1307     3.0       0.0                    Zakarian, Mr. Ortin    male  27.0
1308     3.0       0.0                     Zimmerman, Mr. Leo    male  29.0

      sibsp  parch      ticket     fare cabin embarked boat   body  \
323     1.0    0.0   P/PP 3381  24.0000   NaN        C  NaN    NaN
324     1.0    0.0   P/PP 3381  24.0000   NaN        C   10    NaN
325     0.0    0.0      248744  13.0000   NaN        S  NaN    NaN
326     0.0    0.0      231945  11.5000   NaN        S  NaN    NaN
327     0.0    0.0  C.A. 34050  10.5000   NaN        S  NaN    NaN
...     ...    ...         ...      ...   ...      ...  ...    ...
1304    1.0    0.0        2665  14.4542   NaN        C  NaN  328.0
1305    1.0    0.0        2665  14.4542   NaN        C  NaN    NaN
1306    0.0    0.0        2656   7.2250   NaN        C  NaN  304.0
1307    0.0    0.0        2670   7.2250   NaN        C  NaN    NaN
1308    0.0    0.0      315082   7.8750   NaN        S  NaN    NaN

                                     home.dest
323                        Russia New York, NY
324                        Russia New York, NY
325                         Bryn Mawr, PA, USA
326   Buenos Aires, Argentina / New Jersey, NJ
327             Cornwall, England Houghton, MI
...                                        ...
1304                                       NaN
1305                                       NaN
1306                                       NaN
1307                                       NaN
1308                                       NaN

[986 rows x 14 columns]

In [27]:
age_not_na=titanic_df[titanic_df["age"].notna()] #known not NA datas
print(age_not_na)

      pclass  survived                                             name  \
0        1.0       1.0                    Allen, Miss. Elisabeth Walton
1        1.0       1.0                   Allison, Master. Hudson Trevor
2        1.0       0.0                     Allison, Miss. Helen Loraine
3        1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4        1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1301     3.0       0.0                             Youseff, Mr. Gerious
1304     3.0       0.0                             Zabour, Miss. Hileni
1306     3.0       0.0                        Zakarian, Mr. Mapriededer
1307     3.0       0.0                              Zakarian, Mr. Ortin
1308     3.0       0.0                               Zimmerman, Mr. Leo

         sex      age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0000    0.0    0.0   24160  211.3375       B5        S    2
1       male   0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11
2     female   2.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
3       male  30.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
4     female  25.0000    1.0    2.0  113781  151.5500  C22 C26        S  NaN
...      ...      ...    ...    ...     ...       ...      ...      ...  ...
1301    male  45.5000    0.0    0.0    2628    7.2250      NaN        C  NaN
1304  female  14.5000    1.0    0.0    2665   14.4542      NaN        C  NaN
1306    male  26.5000    0.0    0.0    2656    7.2250      NaN        C  NaN
1307    male  27.0000    0.0    0.0    2670    7.2250      NaN        C  NaN
1308    male  29.0000    0.0    0.0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1301  312.0                              NaN
1304  328.0                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1046 rows x 14 columns]

In [30]:
age_unknown=titanic_df[titanic_df["age"].isna()] #not known ages NA datas
print(age_unknown)

      pclass  survived                                               name  \
15       1.0       0.0                                Baumann, Mr. John D
37       1.0       1.0      Bradley, Mr. George ("George Arthur Brayton")
40       1.0       0.0                          Brewe, Dr. Arthur Jackson
46       1.0       0.0                              Cairns, Mr. Alexander
59       1.0       1.0  Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...
...      ...       ...                                                ...
1297     3.0       0.0                             Wiseman, Mr. Phillippe
1302     3.0       0.0                                  Yousif, Mr. Wazli
1303     3.0       0.0                              Yousseff, Mr. Gerious
1305     3.0       0.0                              Zabour, Miss. Thamine
1309     NaN       NaN                                                NaN

         sex  age  sibsp  parch      ticket     fare cabin embarked boat  \
15      male  NaN    0.0    0.0    PC 17318  25.9250   NaN        S  NaN
37      male  NaN    0.0    0.0      111427  26.5500   NaN        S    9
40      male  NaN    0.0    0.0      112379  39.6000   NaN        C  NaN
46      male  NaN    0.0    0.0      113798  31.0000   NaN        S  NaN
59    female  NaN    0.0    0.0       17770  27.7208   NaN        C    5
...      ...  ...    ...    ...         ...      ...   ...      ...  ...
1297    male  NaN    0.0    0.0  A/4. 34244   7.2500   NaN        S  NaN
1302    male  NaN    0.0    0.0        2647   7.2250   NaN        C  NaN
1303    male  NaN    0.0    0.0        2627  14.4583   NaN        C  NaN
1305  female  NaN    1.0    0.0        2665  14.4542   NaN        C  NaN
1309     NaN  NaN    NaN    NaN         NaN      NaN   NaN      NaN  NaN

      body         home.dest
15     NaN      New York, NY
37     NaN   Los Angeles, CA
40     NaN  Philadelphia, PA
46     NaN               NaN
59     NaN      New York, NY
...    ...               ...
1297   NaN               NaN
1302   NaN               NaN
1303   NaN               NaN
1305   NaN               NaN
1309   NaN               NaN

[264 rows x 14 columns]

In [34]:
index_columns=titanic_df.iloc[10:26, 3:6]  #Printing the rows from index 10 to 25 and columns 3 to 5 (3. Ans)
print(index_columns)

       sex   age  sibsp
10    male  47.0    1.0
11  female  18.0    1.0
12  female  24.0    0.0
13  female  26.0    0.0
14    male  80.0    0.0
15    male   NaN    0.0
16    male  24.0    0.0
17  female  50.0    0.0
18  female  32.0    0.0
19    male  36.0    0.0
20    male  37.0    1.0
21  female  47.0    1.0
22    male  26.0    0.0
23  female  42.0    0.0
24  female  29.0    0.0
25    male  25.0    0.0

In [39]:
titanic_df[["sex", "fare"]].groupby("sex").mean() #the mean ticket fare price for each of the sex using groupby() (4. Ans)

             fare
sex
female  46.198097
male    26.154601

In [40]:
titanic_df[["pclass", "fare"]].groupby("pclass").mean()  # the mean ticket fare price for the cabin class combinations (4. Ans)

             fare
pclass
1.0     87.508992
2.0     21.179196
3.0     13.302889

In [43]:
titanic_df.agg(
    {
        "age": ["min", "max", "median", "skew"],
        "fare": ["min", "max", "median", "mean"],
    }
)

              age        fare
min      0.166700    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
skew     0.407672         NaN
mean          NaN   33.295479